ConnectTest/src/Enums/messageStatuses/messageStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>messageStatuses</name>
	<enumValues>
		<name>sent</name>
	</enumValues>
	<enumValues>
		<name>notSent</name>
	</enumValues>
	<enumValues>
		<name>delivered</name>
	</enumValues>
	<enumValues>
		<name>notDelivered</name>
	</enumValues>
	<enumValues>
		<name>read</name>
	</enumValues>
	<enumValues>
		<name>undefined</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/CommonModules/SMSTraffic/Module.bsl
Функция sendSMS(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.server, Параметры.port,,,, Параметры.timeout, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.UseOSAuthentication);	
	
	URL	= "smartdelivery-in/multi.php/?login=" + Параметры.account + "&password=" + Параметры.password + "&phones=" + Параметры.phone + "&message=" + Параметры.text + "&originator=" + Параметры.senderName + "&want_sms_ids=1";
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТелоЗапроса);
	ТекущийПуть = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.firstName = "code" Тогда
				ТекущийПуть = "code";
			ИначеЕсли ЧтениеXML.firstName = "description" Тогда
				ТекущийПуть = "description";
			ИначеЕсли ЧтениеXML.firstName = "result" Тогда
				ТекущийПуть = "result";
			ИначеЕсли ЧтениеXML.firstName = "sms_id" Тогда
				ТекущийПуть = "sms_id";
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если ТекущийПуть = "code" Тогда
				Код = ЧтениеXML.Значение;
			ИначеЕсли ТекущийПуть = "description" Тогда
				РасшифровкаОшибки = ЧтениеXML.Значение;
			ИначеЕсли ТекущийПуть = "result" Тогда
				Результат = ЧтениеXML.Значение;
			ИначеЕсли ТекущийПуть = "sms_id" Тогда
				sms_id = ЧтениеXML.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Код = "0" И Результат = "OK" Тогда
		Ответ.Вставить("id", sms_id);
		Ответ.Вставить("messageStatus", Перечисления.messageStatuses.sent);		
	Иначе
		Ответ.Вставить("error", РасшифровкаОшибки);		
	КонецЕсли;
	
	Ответ.Вставить("period", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;	
	
КонецФункции

Функция checkSmsStatus(Параметры, Ответ) Экспорт
	
	HTTPСоединение	= Новый HTTPСоединение(Параметры.server, Параметры.port,,,, Параметры.timeout, ?(Параметры.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено), Параметры.UseOSAuthentication);	
	
	URL	= "smartdelivery-in/multi.php/?login=" + Параметры.account + "&password=" + Параметры.password + "&operation=status&sd=false" + "&sms_id=" + Параметры.id + "&sd=false&route=viber(60)-sms";
	ЗапросHTTP	= Новый HTTPЗапрос(URL);
	ОтветHTTP	= HTTPСоединение.Получить(ЗапросHTTP);
	ТелоЗапроса	= СокрЛП(ОтветHTTP.ПолучитьТелоКакСтроку());
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТелоЗапроса);
	ТекущийПуть = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.firstName = "status" Тогда
				ТекущийПуть = "status";
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			Если ТекущийПуть = "status" Тогда
				ОтветСтатус = ЧтениеXML.Значение;
				ТекущийПуть = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Статус	= СтатусСообщения(Врег(ОтветСтатус));
	Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.messageStatuses") Тогда
		Ответ.Вставить("messageStatus", Статус);
	Иначе
		Ответ.Вставить("messageStatus", Перечисления.messageStatuses.notDelivered);
		Ответ.Вставить("error","Неизвестный статус");
	КонецЕсли;
	
	Ответ.Вставить("period", УниверсальноеВремя(ТекущаяДата()));
	
	Возврат Ответ;
	
КонецФункции

Функция СтатусСообщения(Статус)
	
	Если Статус = "SENT" Или Статус = "NOT_ROUTED" Или Статус = "ACCEPTD" Или Статус = "UNDELIVERED" Тогда
		Возврат Перечисления.messageStatuses.sent;
	ИначеЕсли Статус = "DOUBLED" Или Статус = "error" Тогда
		Возврат Перечисления.messageStatuses.notSent;
	ИначеЕсли Статус = "DELIVERED" Тогда
		Возврат Перечисления.messageStatuses.delivered;
	ИначеЕсли Статус = "TIMEOUT" Или Статус = "EXPIRED" Тогда
		Возврат Перечисления.messageStatuses.notDelivered;
	ИначеЕсли Статус = "READ" Тогда
		Возврат Перечисления.messageStatuses.read;
	Иначе
		Возврат Статус;
	КонецЕсли;
	
КонецФункции
